Public Attributes | List of all members
API_OverrideRuleStyle Struct Reference
Graphic Overrides
Specifies what, and how an API_OverrideRule should override. More...
#include <APIdefs_Environment.h>
 Public Attributes
 API_OverriddenAttribute  | lineType
Specifies how the line type should be overridden.
 API_OverriddenPen  | lineMarkerTextPen
Specifies how the line/marker/text pen should be overridden.
 API_OverriddenAttribute  | fillOverride
Specifies how the fills should be overridden.
 API_OverriddenFillType  | fillType
Specifies which fills should be overridden.
 API_OverriddenPen  | fillForegroundPenOverride
Specifies how the fill foreground pen should be overridden.
 API_OverriddenFillType  | fillTypeForegroundPen
Specifies which fill foreground pen should be overridden.
 API_OverriddenPenOrRGB  | fillBackgroundPenOverride
Specifies how the fill background pen should be overridden.
 API_OverriddenFillType  | fillTypeBackgroundPen
Specifies which fill background pen should be overridden.
 API_OverriddenAttributeOrRGB  | surfaceOverride
Specifies how the surface should be overridden.
 API_OverriddenSurfaceType  | surfaceType
Specifies which surface should be overridden.
 bool  | showSkinSeparators
Specifies if the skin separators should be shown.
 bool  | overridePenColorAndThickness
Specifies if the pen color and thickness should be overridden.
 API_OverriddenSurfaceType  | hiddenContours
Specifies which contours should be hidden.
 bool  | overrideContours
Specifies if contour hiding should be overridden.
Detailed Description
Specifies what, and how an API_OverrideRule should override.
Since
Archicad 25
Remarks
In version 25, the fillBackgroundPenOverride and surfaceOverride members type are changed to API_OverriddenAttributeOrRGB In version 25, hiddenContours and overrideContours are added